###################################################################

# Created by write_sdc on Sat Jul 10 21:01:37 2021

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_transition 5 [current_design]
set_max_fanout 20 [current_design]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports clk]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports rst_n]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports load_en]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports debug_en]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports serial_in]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sram_select[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sram_select[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports frequency_adc_done]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports amplitude_adc_done]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sig_frequency[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sig_frequency[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sig_frequency[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sig_frequency[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sig_frequency[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sig_frequency[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sig_frequency[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sig_frequency[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sig_amplitude[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sig_amplitude[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sig_amplitude[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sig_amplitude[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sig_amplitude[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sig_amplitude[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sig_amplitude[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports {sig_amplitude[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports adc_bypass_en]
set_load -pin_load 0.009 [get_ports serial_out]
set_load -pin_load 0.009 [get_ports serial_out_valid]
set_load -pin_load 0.009 [get_ports freq_eval_done]
create_clock [get_ports clk]  -name ideal_clock  -period 20  -waveform {0 10}
group_path -name FEEDTHROUGH  -from [list [get_ports rst_n] [get_ports load_en] [get_ports debug_en] [get_ports serial_in] [get_ports {sram_select[1]}] [get_ports {sram_select[0]}] [get_ports frequency_adc_done] [get_ports amplitude_adc_done] [get_ports {sig_frequency[7]}] [get_ports {sig_frequency[6]}] [get_ports {sig_frequency[5]}] [get_ports {sig_frequency[4]}] [get_ports {sig_frequency[3]}] [get_ports {sig_frequency[2]}] [get_ports {sig_frequency[1]}] [get_ports {sig_frequency[0]}] [get_ports {sig_amplitude[7]}] [get_ports {sig_amplitude[6]}] [get_ports {sig_amplitude[5]}] [get_ports {sig_amplitude[4]}] [get_ports {sig_amplitude[3]}] [get_ports {sig_amplitude[2]}] [get_ports {sig_amplitude[1]}] [get_ports {sig_amplitude[0]}] [get_ports adc_bypass_en]]  -to [list [get_ports serial_out] [get_ports serial_out_valid] [get_ports freq_eval_done]]
group_path -name REGIN  -from [list [get_ports rst_n] [get_ports load_en] [get_ports debug_en] [get_ports serial_in] [get_ports {sram_select[1]}] [get_ports {sram_select[0]}] [get_ports frequency_adc_done] [get_ports amplitude_adc_done] [get_ports {sig_frequency[7]}] [get_ports {sig_frequency[6]}] [get_ports {sig_frequency[5]}] [get_ports {sig_frequency[4]}] [get_ports {sig_frequency[3]}] [get_ports {sig_frequency[2]}] [get_ports {sig_frequency[1]}] [get_ports {sig_frequency[0]}] [get_ports {sig_amplitude[7]}] [get_ports {sig_amplitude[6]}] [get_ports {sig_amplitude[5]}] [get_ports {sig_amplitude[4]}] [get_ports {sig_amplitude[3]}] [get_ports {sig_amplitude[2]}] [get_ports {sig_amplitude[1]}] [get_ports {sig_amplitude[0]}] [get_ports adc_bypass_en]]
group_path -name REGOUT  -to [list [get_ports serial_out] [get_ports serial_out_valid] [get_ports freq_eval_done]]
set_input_delay -clock ideal_clock  10  [get_ports clk]
set_input_delay -clock ideal_clock  10  [get_ports rst_n]
set_input_delay -clock ideal_clock  10  [get_ports load_en]
set_input_delay -clock ideal_clock  10  [get_ports debug_en]
set_input_delay -clock ideal_clock  10  [get_ports serial_in]
set_input_delay -clock ideal_clock  10  [get_ports {sram_select[1]}]
set_input_delay -clock ideal_clock  10  [get_ports {sram_select[0]}]
set_input_delay -clock ideal_clock  10  [get_ports frequency_adc_done]
set_input_delay -clock ideal_clock  10  [get_ports amplitude_adc_done]
set_input_delay -clock ideal_clock  10  [get_ports {sig_frequency[7]}]
set_input_delay -clock ideal_clock  10  [get_ports {sig_frequency[6]}]
set_input_delay -clock ideal_clock  10  [get_ports {sig_frequency[5]}]
set_input_delay -clock ideal_clock  10  [get_ports {sig_frequency[4]}]
set_input_delay -clock ideal_clock  10  [get_ports {sig_frequency[3]}]
set_input_delay -clock ideal_clock  10  [get_ports {sig_frequency[2]}]
set_input_delay -clock ideal_clock  10  [get_ports {sig_frequency[1]}]
set_input_delay -clock ideal_clock  10  [get_ports {sig_frequency[0]}]
set_input_delay -clock ideal_clock  10  [get_ports {sig_amplitude[7]}]
set_input_delay -clock ideal_clock  10  [get_ports {sig_amplitude[6]}]
set_input_delay -clock ideal_clock  10  [get_ports {sig_amplitude[5]}]
set_input_delay -clock ideal_clock  10  [get_ports {sig_amplitude[4]}]
set_input_delay -clock ideal_clock  10  [get_ports {sig_amplitude[3]}]
set_input_delay -clock ideal_clock  10  [get_ports {sig_amplitude[2]}]
set_input_delay -clock ideal_clock  10  [get_ports {sig_amplitude[1]}]
set_input_delay -clock ideal_clock  10  [get_ports {sig_amplitude[0]}]
set_input_delay -clock ideal_clock  10  [get_ports adc_bypass_en]
set_output_delay -clock ideal_clock  0  [get_ports serial_out]
set_output_delay -clock ideal_clock  0  [get_ports serial_out_valid]
set_output_delay -clock ideal_clock  0  [get_ports freq_eval_done]
